Revit 2024 API
ExportPatternInfo Constructor (ExportPatternInfo)
 Constructs a new copy of the input ExportPatternInfo object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ExportPatternInfo(
	ExportPatternInfo other
)
Visual Basic
Public Sub New ( _
	other As ExportPatternInfo _
)
Visual C++
public:
ExportPatternInfo(
	ExportPatternInfo^ other
)
Parameters
other
Type: Autodesk.Revit.DB.ExportPatternInfo
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExportPatternInfo Class
ExportPatternInfo Overload
Autodesk.Revit.DB Namespace